app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" WHERE (title || body ILIKE '%Markdown%') ORDER BY created_at DESC

  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello World!"], ["body", "I'm learn Ruby on Rails with CoderSchool. It's awesome!"], ["created_at", "2017-06-03 03:43:51.910074"], ["updated_at", "2017-06-03 03:43:51.910074"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3