app/controllers/comments_controller.rb

	def create
		@comment = @article.comments.create(comment_params)
---
INSERT INTO "comments" ("content", "article_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "asdfasdf"], ["article_id", 1], ["created_at", "2017-06-03 16:40:56.765922"], ["updated_at", "2017-06-03 16:40:56.765922"], ["user_id", 1]]

	def find_article
		@article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

	def find_comment
		@comment = @article.comments.find(params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["article_id", 3], ["id", 2], ["LIMIT", 1]]